; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_6_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 - counter
	)
  (:init
		(= (value c0) 7)
	(= (value c1) 36)
	(= (value c2) 96)
	(= (value c3) 59)
	(= (value c4) 76)
	(= (value c5) 32)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
		)
	)
)

; plan
1. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 3 of 5
2. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 3 of 5
3. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 3 of 5
4. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 3 of 5
5. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 3 of 5
6. (increase_rate c3)
   changed: (rate_value c3) from 5 to 6
   goals met: 3 of 5
7. (increase_rate c3)
   changed: (rate_value c3) from 6 to 7
   goals met: 3 of 5
8. (increase_rate c3)
   changed: (rate_value c3) from 7 to 8
   goals met: 3 of 5
9. (increment c3)
   changed: (value c3) from 59 to 67
   goals met: 3 of 5
10. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 3 of 5
11. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 3 of 5
12. (increment c3)
   changed: (value c3) from 67 to 75
   goals met: 3 of 5
13. (increase_rate c3)
   changed: (rate_value c3) from 8 to 9
   goals met: 3 of 5
14. (increase_rate c3)
   changed: (rate_value c3) from 9 to 10
   goals met: 3 of 5
15. (increment c3)
   changed: (value c3) from 75 to 85
   goals met: 2 of 5
16. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 2 of 5
17. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 2 of 5
18. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 2 of 5
19. (increase_rate c5)
   changed: (rate_value c5) from 3 to 4
   goals met: 2 of 5
20. (increase_rate c5)
   changed: (rate_value c5) from 4 to 5
   goals met: 2 of 5
21. (increase_rate c5)
   changed: (rate_value c5) from 5 to 6
   goals met: 2 of 5
22. (increment c5)
   changed: (value c5) from 32 to 38
   goals met: 2 of 5
23. (increase_rate c5)
   changed: (rate_value c5) from 6 to 7
   goals met: 2 of 5
24. (increase_rate c5)
   changed: (rate_value c5) from 7 to 8
   goals met: 2 of 5
25. (increment c5)
   changed: (value c5) from 38 to 46
   goals met: 2 of 5
26. (increment c5)
   changed: (value c5) from 46 to 54
   goals met: 2 of 5
27. (increment c5)
   changed: (value c5) from 54 to 62
   goals met: 2 of 5
28. (increment c5)
   changed: (value c5) from 62 to 70
   goals met: 2 of 5
29. (increment c5)
   changed: (value c5) from 70 to 78
   goals met: 3 of 5
30. (decrement c3)
   changed: (value c3) from 85 to 75
   goals met: 4 of 5
31. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 4 of 5
32. (increase_rate c2)
   changed: (rate_value c2) from 3 to 4
   goals met: 4 of 5
33. (decrement c2)
   changed: (value c2) from 96 to 92
   goals met: 4 of 5
34. (decrement c2)
   changed: (value c2) from 92 to 88
   goals met: 4 of 5
35. (increment c3)
   changed: (value c3) from 75 to 85
   goals met: 3 of 5
36. (decrement c2)
   changed: (value c2) from 88 to 84
   goals met: 4 of 5
37. (decrement c3)
   changed: (value c3) from 85 to 75
   goals met: 4 of 5
38. (decrement c2)
   changed: (value c2) from 84 to 80
   goals met: 4 of 5
39. (decrement c2)
   changed: (value c2) from 80 to 76
   goals met: 4 of 5
40. (decrement c2)
   changed: (value c2) from 76 to 72
   goals met: 5 of 5
